
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/14681882585)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 15 to add, 0 to change, 33 to destroy.</code></pre>

* Create
  * module.prod__k8s_nodes.null_resource.gateway_provision_ip_routing
  * module.prod__k8s_nodes.null_resource.gateway_provision_ssh_private_key__gateway
  * module.prod__k8s_nodes.null_resource.gateway_provision_ssh_private_key__pve
  * module.prod__k8s_nodes.null_resource.vm_ci_config__control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.null_resource.vm_ci_config__gateway
  * module.prod__k8s_nodes.null_resource.vm_ci_config__worker[&#34;1&#34;]
  * module.prod__k8s_nodes.proxmox_vm_qemu.control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.proxmox_vm_qemu.gateway
  * module.prod__k8s_nodes.proxmox_vm_qemu.worker[&#34;1&#34;]
  * module.prod__k8s_nodes.random_password.vm_root_password__control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.random_password.vm_root_password__gateway
  * module.prod__k8s_nodes.random_password.vm_root_password__worker[&#34;1&#34;]
  * module.prod__k8s_nodes.random_password.vm_user_password__control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.random_password.vm_user_password__gateway
  * module.prod__k8s_nodes.random_password.vm_user_password__worker[&#34;1&#34;]
* Delete
  * null_resource.ansible_runner_provision_ssh_files
  * null_resource.k8s_nodes_run_ansible__prod
  * null_resource.vm_ci_config__ansible_runner
  * proxmox_vm_qemu.ansible_runner
  * random_password.hacluster_user_password
  * random_password.vm_root_password__ansible_runner
  * random_password.vm_user_password__ansible_runner
  * module.k8s_nodes__prod.null_resource.gateway_provision_ssh_private_key[&#34;1&#34;]
  * module.k8s_nodes__prod.null_resource.gateway_provision_ssh_private_key[&#34;2&#34;]
  * module.k8s_nodes__prod.null_resource.vm_ci_config__control_plane[&#34;1&#34;]
  * module.k8s_nodes__prod.null_resource.vm_ci_config__gateway[&#34;1&#34;]
  * module.k8s_nodes__prod.null_resource.vm_ci_config__gateway[&#34;2&#34;]
  * module.k8s_nodes__prod.null_resource.vm_ci_config__worker[&#34;1&#34;]
  * module.k8s_nodes__prod.proxmox_vm_qemu.control_plane[&#34;1&#34;]
  * module.k8s_nodes__prod.proxmox_vm_qemu.gateway[&#34;1&#34;]
  * module.k8s_nodes__prod.proxmox_vm_qemu.gateway[&#34;2&#34;]
  * module.k8s_nodes__prod.proxmox_vm_qemu.worker[&#34;1&#34;]
  * module.k8s_nodes__prod.random_password.vm_root_password__control_plane[&#34;1&#34;]
  * module.k8s_nodes__prod.random_password.vm_root_password__gateway[&#34;1&#34;]
  * module.k8s_nodes__prod.random_password.vm_root_password__gateway[&#34;2&#34;]
  * module.k8s_nodes__prod.random_password.vm_root_password__worker[&#34;1&#34;]
  * module.k8s_nodes__prod.random_password.vm_user_password__control_plane[&#34;1&#34;]
  * module.k8s_nodes__prod.random_password.vm_user_password__gateway[&#34;1&#34;]
  * module.k8s_nodes__prod.random_password.vm_user_password__gateway[&#34;2&#34;]
  * module.k8s_nodes__prod.random_password.vm_user_password__worker[&#34;1&#34;]
  * module.zabbix_server__prod.null_resource.vm_ci_config[&#34;1&#34;]
  * module.zabbix_server__prod.null_resource.vm_ci_config[&#34;2&#34;]
  * module.zabbix_server__prod.proxmox_vm_qemu.zabbix_server[&#34;1&#34;]
  * module.zabbix_server__prod.proxmox_vm_qemu.zabbix_server[&#34;2&#34;]
  * module.zabbix_server__prod.random_password.vm_root_password[&#34;1&#34;]
  * module.zabbix_server__prod.random_password.vm_root_password[&#34;2&#34;]
  * module.zabbix_server__prod.random_password.vm_user_password[&#34;1&#34;]
  * module.zabbix_server__prod.random_password.vm_user_password[&#34;2&#34;]


<details><summary>Change Result (Click me)</summary>

:warning: **The content is omitted as it is too long.** :warning:

```hcl

  # null_resource.ansible_runner_provision_ssh_files will be destroyed
  # (because null_resource.ansible_runner_provision_ssh_files is not in configuration)
  - resource "null_resource" "ansible_runner_provision_ssh_files" {
      - id = "2864240868289895189" -> null
    }

  # null_resource.k8s_nodes_run_ansible__prod will be destroyed
  # (because null_resource.k8s_nodes_run_ansible__prod is not in configuration)
  - resource "null_resource" "k8s_nodes_run_ansible__prod" {
      - id       = "592593560762931218" -> null
      - triggers = {
          - "always_run" = "2025-04-26T11:21:01Z"
        } -> null
    }

  # null_resource.vm_ci_config__ansible_runner will be destroyed
  # (because null_resource.vm_ci_config__ansible_runner is not in configuration)
  - resource "null_resource" "vm_ci_config__ansible_runner" {
      - id = "4217893017187870982" -> null
    }

  # proxmox_vm_qemu.ansible_runner will be destroyed
  # (because proxmox_vm_qemu.ansible_runner is not in configuration)
  - resource "proxmox_vm_qemu" "ansible_runner" {
      - additional_wait        = 5 -> null
      - agent                  = 1 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "c" -> null
      - bootdisk               = "virtio0" -> null
      - cicustom               = "user=local:snippets/vm_ci-config__ansible-runner.yaml" -> null
      - ciupgrade              = false -> null
      - clone                  = "alma-9.5" -> null
      - clone_wait             = 10 -> null
      - cores                  = 1 -> null
      - cpu_type               = "x86-64-v3" -> null
      - default_ipv4_address   = "192.168.20.8" -> null
      - define_connection_info = true -> null
      - desc                   = "This VM is managed by Terraform." -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb,memory,cpu" -> null
      - id                     = "pve-01/qemu/809" -> null
      - ipconfig0              = "ip=192.168.20.8/24,gw=192.168.20.1" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 2048 -> null
      - name                   = "ansible-runner" -> null
      - numa                   = true -> null
      - onboot                 = true -> null
      - os_type                = "cloud-init" -> null
      - protection             = false -> null
      - qemu_os                = "l26" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-single" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_host               = "192.168.20.8" -> null
      - ssh_port               = "22" -> null
      - tablet                 = true -> null
      - tags                   = "terraform" -> null
      - target_node            = "pve-01" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
      - vmid                   = 809 -> null
        # (10 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - virtio {
              - virtio0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = true -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "10G" -> null
                      - storage              = "local-lvm" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "vmbr0" -> null
          - firewall  = false -> null
          - id        = 0 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:d0:9d:84" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

      - smbios {
          - uuid         = "c101f9ce-ffae-414c-9bc8-0f2048d89154" -> null
            # (6 unchanged attributes hidden)
        }

      - vga {
          - memory = 0 -> null
          - type   = "serial0" -> null
        }
    }

  # random_password.hacluster_user_password will be destroyed
  # (because random_password.hacluster_user_password is not in configuration)
  - resource "random_password" "hacluster_user_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # random_password.vm_root_password__ansible_runner will be destroyed
  # (because random_password.vm_root_password__ansible_runner is not in configuration)
  - resource "random_password" "vm_root_password__ansible_runner" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # random_password.vm_user_password__ansible_runner will be destroyed
  # (because random_password.vm_user_password__ansible_runner is not in configuration)
  - resource "random_password" "vm_user_password__ansible_runner" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.k8s_nodes__prod.null_resource.gateway_provision_ssh_private_key["1"] will be destroyed
  # (because null_resource.gateway_provision_ssh_private_key is not in configuration)
  - resource "null_resource" "gateway_provision_ssh_private_key" {
      - id = "978456721054666065" -> null
    }

  # module.k8s_nodes__prod.null_resource.gateway_provision_ssh_private_key["2"] will be destroyed
  # (because null_resource.gateway_provision_ssh_private_key is not in configuration)
  - resource "null_resource" "gateway_provision_ssh_private_key" {
      - id = "3456201397305137588" -> null
    }

  # module.k8s_nodes__prod.null_resource.vm_ci_config__control_plane["1"] will be destroyed
  # (because null_resource.vm_ci_config__control_plane is not in configuration)
  - resource "null_resource" "vm_ci_config__control_plane" {
      - id = "2325261516263652732" -> null
    }

  # module.k8s_nodes__prod.null_resource.vm_ci_config__gateway["1"] will be destroyed
  # (because null_resource.vm_ci_config__gateway is not in configuration)
  - resource "null_resource" "vm_ci_config__gateway" {
      - id = "1656176267760455401" -> null
    }

  # module.k8s_nodes__prod.null_resource.vm_ci_config__gateway["2"] will be destroyed
  # (because null_resource.vm_ci_config__gateway is not in configuration)
  - resource "null_resource" "vm_ci_config__gateway" {
      - id = "1883294002736179852" -> null
    }

  # module.k8s_nodes__prod.null_resource.vm_ci_config__worker["1"] will be destroyed
  # (because null_resource.vm_ci_config__worker is not in configuration)
  - resource "null_resource" "vm_ci_config__worker" {
      - id = "4169591598013415975" -> null
    }

  # module.k8s_nodes__prod.proxmox_vm_qemu.control_plane["1"] will be destroyed
  # (because proxmox_vm_qemu.control_plane is not in configuration)
  - resource "proxmox_vm_qemu" "control_plane" {
      - additional_wait        = 5 -> null
      - agent                  = 1 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "c" -> null
      - bootdisk               = "virtio0" -> null
      - cicustom               = "user=local:snippets/prod__k8s-vm_ci-config__cp-01.yaml" -> null
      - ciupgrade              = false -> null
      - clone                  = "alma-9.5" -> null
      - clone_wait             = 10 -> null
      - cores                  = 3 -> null
      - cpu_type               = "x86-64-v3" -> null
      - default_ipv4_address   = "192.168.8.11" -> null
      - define_connection_info = true -> null
      - desc                   = "This VM is managed by Terraform to run k8s." -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb,memory,cpu" -> null
      - id                     = "pve-01/qemu/811" -> null
      - ipconfig0              = "ip=192.168.8.11/24,gw=192.168.8.201" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 3072 -> null
      - name                   = "prod-k8s-cp-01" -> null
      - numa                   = true -> null
      - onboot                 = true -> null
      - os_type                = "cloud-init" -> null
      - protection             = false -> null
      - qemu_os                = "l26" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-single" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_host               = "192.168.8.11" -> null
      - ssh_port               = "22" -> null
      - tablet                 = true -> null
      - tags                   = "control_plane;k8s;prod;terraform" -> null
      - target_node            = "pve-01" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
      - vmid                   = 811 -> null
        # (10 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - virtio {
              - virtio0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = true -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "20G" -> null
                      - storage              = "local-lvm" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "vmbr1" -> null
          - firewall  = false -> null
          - id        = 0 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:2f:44:7c" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

      - smbios {
          - uuid         = "873905bf-0586-4758-8fd7-4e286e240c6e" -> null
            # (6 unchanged attributes hidden)
        }

      - vga {
          - memory = 0 -> null
          - type   = "serial0" -> null
        }
    }

  # module.k8s_nodes__prod.proxmox_vm_qemu.gateway["1"] will be destroyed
  # (because proxmox_vm_qemu.gateway is not in configuration)
  - resource "proxmox_vm_qemu" "gateway" {
      - additional_wait        = 5 -> null
      - agent                  = 1 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "c" -> null
      - bootdisk               = "virtio0" -> null
      - cicustom               = "user=local:snippets/prod__k8s-vm_ci-config__gw-01.yaml" -> null
      - ciupgrade              = false -> null
      - clone                  = "alma-9.5" -> null
      - clone_wait             = 10 -> null
      - cores                  = 2 -> null
      - cpu_type               = "x86-64-v3" -> null
      - default_ipv4_address   = "192.168.20.5" -> null
      - define_connection_info = true -> null
      - desc                   = "This VM is managed by Terraform to run k8s." -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb,memory,cpu" -> null
      - id                     = "pve-01/qemu/801" -> null
      - ipconfig0              = "ip=192.168.20.5/24,gw=192.168.20.1" -> null
      - ipconfig1              = "ip=192.168.8.1/24,gw=192.168.8.201" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 2048 -> null
      - name                   = "prod-k8s-gw-01" -> null
      - numa                   = true -> null
      - onboot                 = true -> null
      - os_type                = "cloud-init" -> null
      - protection             = false -> null
      - qemu_os                = "l26" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-single" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_host               = "192.168.20.5" -> null
      - ssh_port               = "22" -> null
      - tablet                 = true -> null
      - tags                   = "gateway;k8s;prod;terraform;zabbix-proxy" -> null
      - target_node            = "pve-01" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
      - vmid                   = 801 -> null
        # (10 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - virtio {
              - virtio0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = true -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "20G" -> null
                      - storage              = "local-lvm" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "vmbr0" -> null
          - firewall  = false -> null
          - id        = 0 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:e1:51:7c" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }
      - network {
          - bridge    = "vmbr1" -> null
          - firewall  = false -> null
          - id        = 1 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:ff:d0:7b" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

      - smbios {
          - uuid         = "5a830925-d680-485c-9e91-3241ce38a75b" -> null
            # (6 unchanged attributes hidden)
        }

      - vga {
          - memory = 0 -> null
          - type   = "serial0" -> null
        }
    }

  # module.k8s_nodes__prod.proxmox_vm_qemu.gateway["2"] will be destroyed
  # (because proxmox_vm_qemu.gateway is not in configuration)
  - resource "proxmox_vm_qemu" "gateway" {
      - additional_wait        = 5 -> null
      - agent                  = 1 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> nu

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

name                   = "prod-k8s-wk-01"
      + numa                   = true
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + qemu_os                = "l26"
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "prod;terraform;k8s;worker"
      + target_node            = "pve-01"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 821

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

  # module.prod__k8s_nodes.random_password.vm_root_password__control_plane["1"] will be created
  + resource "random_password" "vm_root_password__control_plane" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_root_password__gateway will be created
  + resource "random_password" "vm_root_password__gateway" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_root_password__worker["1"] will be created
  + resource "random_password" "vm_root_password__worker" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_user_password__control_plane["1"] will be created
  + resource "random_password" "vm_user_password__control_plane" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_user_password__gateway will be created
  + resource "random_password" "vm_user_password__gateway" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_user_password__worker["1"] will be created
  + resource "random_password" "vm_user_password__worker" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.zabbix_server__prod.null_resource.vm_ci_config["1"] will be destroyed
  # (because null_resource.vm_ci_config is not in configuration)
  - resource "null_resource" "vm_ci_config" {
      - id = "4727960251723690023" -> null
    }

  # module.zabbix_server__prod.null_resource.vm_ci_config["2"] will be destroyed
  # (because null_resource.vm_ci_config is not in configuration)
  - resource "null_resource" "vm_ci_config" {
      - id = "4523634655192463803" -> null
    }

  # module.zabbix_server__prod.proxmox_vm_qemu.zabbix_server["1"] will be destroyed
  # (because proxmox_vm_qemu.zabbix_server is not in configuration)
  - resource "proxmox_vm_qemu" "zabbix_server" {
      - additional_wait        = 5 -> null
      - agent                  = 1 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "c" -> null
      - bootdisk               = "virtio0" -> null
      - cicustom               = "user=local:snippets/prod__zbx-srv-01.yaml" -> null
      - ciupgrade              = false -> null
      - clone                  = "alma-9.5" -> null
      - clone_wait             = 10 -> null
      - cores                  = 2 -> null
      - cpu_type               = "x86-64-v3" -> null
      - default_ipv4_address   = "192.168.20.9" -> null
      - define_connection_info = true -> null
      - desc                   = "This VM is managed by Terraform." -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb,memory,cpu" -> null
      - id                     = "pve-01/qemu/201" -> null
      - ipconfig0              = "ip=192.168.20.9/24,gw=192.168.20.1" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 4096 -> null
      - name                   = "prod-zbx-srv-01" -> null
      - numa                   = true -> null
      - onboot                 = true -> null
      - os_type                = "cloud-init" -> null
      - protection             = false -> null
      - qemu_os                = "l26" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-single" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_host               = "192.168.20.9" -> null
      - ssh_port               = "22" -> null
      - tablet                 = true -> null
      - tags                   = "prod;terraform;zabbix-server" -> null
      - target_node            = "pve-01" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
      - vmid                   = 201 -> null
        # (10 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - virtio {
              - virtio0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = true -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "40G" -> null
                      - storage              = "local-lvm" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "vmbr0" -> null
          - firewall  = false -> null
          - id        = 0 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:76:85:ff" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

      - smbios {
          - uuid         = "4cfc7603-e76c-4187-b670-49bc200051c5" -> null
            # (6 unchanged attributes hidden)
        }

      - vga {
          - type = "serial0" -> null
        }
    }

  # module.zabbix_server__prod.proxmox_vm_qemu.zabbix_server["2"] will be destroyed
  # (because proxmox_vm_qemu.zabbix_server is not in configuration)
  - resource "proxmox_vm_qemu" "zabbix_server" {
      - additional_wait        = 5 -> null
      - agent                  = 1 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "c" -> null
      - bootdisk               = "virtio0" -> null
      - cicustom               = "user=local:snippets/prod__zbx-srv-02.yaml" -> null
      - ciupgrade              = false -> null
      - clone                  = "alma-9.5" -> null
      - clone_wait             = 10 -> null
      - cores                  = 2 -> null
      - cpu_type               = "x86-64-v3" -> null
      - default_ipv4_address   = "192.168.20.10" -> null
      - define_connection_info = true -> null
      - desc                   = "This VM is managed by Terraform." -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb,memory,cpu" -> null
      - id                     = "pve-01/qemu/202" -> null
      - ipconfig0              = "ip=192.168.20.10/24,gw=192.168.20.1" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 4096 -> null
      - name                   = "prod-zbx-srv-02" -> null
      - numa                   = true -> null
      - onboot                 = true -> null
      - os_type                = "cloud-init" -> null
      - protection             = false -> null
      - qemu_os                = "l26" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-single" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_host               = "192.168.20.10" -> null
      - ssh_port               = "22" -> null
      - tablet                 = true -> null
      - tags                   = "prod;terraform;zabbix-server" -> null
      - target_node            = "pve-01" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
      - vmid                   = 202 -> null
        # (10 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - virtio {
              - virtio0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = true -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "40G" -> null
                      - storage              = "local-lvm" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "vmbr0" -> null
          - firewall  = false -> null
          - id        = 0 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:e1:6e:61" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

      - smbios {
          - uuid         = "fd75088e-834b-4c96-a79d-6d57f8ff803a" -> null
            # (6 unchanged attributes hidden)
        }

      - vga {
          - type = "serial0" -> null
        }
    }

  # module.zabbix_server__prod.random_password.vm_root_password["1"] will be destroyed
  # (because random_password.vm_root_password is not in configuration)
  - resource "random_password" "vm_root_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # module.zabbix_server__prod.random_password.vm_root_password["2"] will be destroyed
  # (because random_password.vm_root_password is not in configuration)
  - resource "random_password" "vm_root_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # module.zabbix_server__prod.random_password.vm_user_password["1"] will be destroyed
  # (because random_password.vm_user_password is not in configuration)
  - resource "random_password" "vm_user_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # module.zabbix_server__prod.random_password.vm_user_password["2"] will be destroyed
  # (because random_password.vm_user_password is not in configuration)
  - resource "random_password" "vm_user_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = true -> null
      - upper       = true -> null
    }

Plan: 15 to add, 0 to change, 33 to destroy.

Changes to Outputs:
  - k8s_control_plane_nodes__prod = [
      - {
          - host_name = "prod-k8s-cp-01"
          - ip        = "192.168.8.11"
        },
    ] -> null
  - k8s_gateway_node__prod        = [
      - {
          - host_name = "prod-k8s-gw-01"
          - ip        = {
              - internal = "192.168.8.1"
              - public   = "192.168.20.5"
            }
        },
      - {
          - host_name = "prod-k8s-gw-02"
          - ip        = {
              - internal = "192.168.8.2"
              - public   = "192.168.20.6"
            }
        },
    ] -> null
  - k8s_worker_nodes__prod        = [
      - {
          - host_name = "prod-k8s-wk-01"
          - ip        = "192.168.8.21"
        },
    ] -> null
  + prod__k8s_control_plane_nodes = [
      + {
          + ip0     = (known after apply)
          + vm_name = "prod-k8s-cp-01"
        },
    ]
  + prod__k8s_gateway_node        = {
      + ip0     = (known after apply)
      + vm_name = "prod-k8s-gw-01"
    }
  + prod__k8s_worker_nodes        = [
      + {
          + ip0     = (known after apply)
          + vm_name = "prod-k8s-wk-01"
        },
    ]
  - zabbix_server_nodes__prod     = [
      - {
          - host_name = "prod-zbx-srv-01"
          - ip        = "192.168.20.9"
        },
      - {
          - host_name = "prod-zbx-srv-02"
          - ip        = "192.168.20.10"
        },
    ] -> null
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":91,"Program":"tfcmt","SHA1":"94c3cffbac3c070e41b024e089789c99bff79e23","Vars":{},"WorkflowName":"Terraform CI"} -->